/* Считывается число строк, с помощью fgets пропускается одна строка,
 * Создаются две структуры данных, одна предназначена для введенной маски, вторая для адреса компа
 * Производится побитовая конъюнкция
 * Результат побитовой коньюнкции записывается в массив с сепараторами по одной цифре и в каждой строке ищется подстрока с таким адресом сети
 * Для адреса сети находится соответствующий интерфейс, создаётся исключение для несуществующего адреса сети. */

#include <stdio.h>
int main()
{
    FILE * inp = fopen("")
    return 0;
}
